from aiogram.enums import ContentType
TOKEN = "7886082907:AAGMmiaaXUZfNMK3UpfqRcKAsLRzj2XNhJY"

ADMINS = [7232041443, 7393504121]  # 7393504121, 1084051085

FIRST_GROUP_ADMIN = [7232041443]
SECOND_GROUP_ADMIN = [7393504121]

FIRST_GROUP_STUDENTS = [7232041443, 7393504121]
SECOND_GROUP_STUDENTS = [7393504121, 7232041443]

STUDENTS = [7393504121, 7232041443]


AVAILABLE_CONTENT_TYPES = [ContentType.TEXT, ContentType.DOCUMENT, ContentType.PHOTO, ContentType.VOICE, ContentType.POLL, ]
DATABASE_CONFIG = {
    'user': 'root',
    'password': 'root',
    'database': 'group_bot',
    'host': '127.0.0.1'
}


first_group_students = "Список учеников - 1-я подгруппа:\n\n1. Абдувалиев Фотихбек\n2. Абдужабаров Умархожа\n3. Алиев Амирбек\n4. Ахмеджанов Тимур\n5. Джалилов Мирсаид\n6. Дониёров Баходир\n7. Исроилова Доно\n8. Каромат Трипатхи Рам Рамиз\n9. Кобулжонов Комилжон\n10. Мамажонов Мухаммадали\n11. Мансуров Музаффарбек\n12. Мирзажонов Ибрагим\n13. Назирова Нигина"
second_group_students = "Список учеников - 2-я подгруппа:\n\n1. Низамиддинов Азизбек\n2. Олтинбекова Согдиана\n3. Саидов Амирбек\n4. Сидиков Хабибулло\n5. Тулаев Азимжон\n6. Тохирбеков Жасурбек\n7. Турдикулов Анвар\n8. Уринбоев Комронбек\n9. Хаитов Шохжахон\n10. Хамзин Самир\n11. Хан Руслан\n12. Холматов Хондамир\n13. Хусанова Амелия"
group_students = {'1': first_group_students, '2': second_group_students}


books = {
    'algebra': r'/Users/ukomron/Downloads/1tn3-main/storage/Алгебра 1-часть.pdf',
    'ogp': r'/Users/ukomron/Downloads/1tn3-main/storage/огп.pdf',
    'oplachko-1': r'/Users/ukomron/Downloads/1tn3-main/storage/Оплачко 1.pdf',
    'oplachko-2': r'/Users/ukomron/Downloads/1tn3-main/storage/Оплачко 2.pdf',
}
books_trivial = {
    'algebra': 'Алгебра',
    'ogp': 'ОГП',
    'oplachko-1': 'Оплачко 1',
    'oplachko-2': 'Оплачко 2',
}

week_days = {
    'monday': 'Понедельник',
    'tuesday': 'Вторник',
    'wednesday': 'Среда',
    'thursday': 'Четверг',
    'friday': 'Пятница',
    'saturday': 'Суббота',
}

SCHEDULE_1 = {
    'monday': "📅 *Понедельник* (1-я группа):\n"
          "1️⃣: | Физкультура | * |🕒 8:30-9:50 | * |🏫 Кабинет: С/З |\n"
          "2️⃣: | Аглийский язык | * |🕒 10:10-11-30 | * |🏫 Кабинет: 210 |\n"
          "3️⃣: | (Н/Н) Литература | * |🕒 12:10-13:30 | * |🏫 Кабинет: 210 |\n"
          "3️⃣: | (Ч/Н) Воспитание | * |🕒 12:10-13:30 | * |🏫 Кабинет: 210|\n",
    'tuesday': "📅 *Вторник* (1-я группа):\n"
          "1️⃣: | Узбекский язык | * |🕒 8:30-9:50 | * |🏫 Кабинет: 210 |\n"
          "2️⃣: | (Н/Н) Химия | * |🕒 10:10-11-30 * |🏫 Кабинет: 106|\n"
          "2️⃣: | (Ч/Н) Биология | * |🕒 10:10-11-30 | * |🏫 Кабинет: 106 |\n"
          "3️⃣: | Геометрия | * |🕒 12:10-13:30 | * |🏫 Кабинет: 209 |",
    'wednesday': "📅 *Среда* (1-я группа):\n"
          "1️⃣: | География | * |🕒 8:30-9:50 | * |🏫 Кабинет: 210 |\n"
          "2️⃣: | Аглийский язык | * |🕒 10:10-11-30 | * |🏫 Кабинет: 27 |\n"
          "3️⃣: | Алгебра  | * |🕒 12:10-13:30 | * |🏫 Кабинет: 210 |",
    'thursday': "📅 *Четверг* (1-я группа):\n"
          "1️⃣: | Геометрия | * |🕒 8:30-9:50 | * |🏫 Кабинет: 210 |\n"
          "2️⃣: | Информатика | * |🕒 10:10-11-30 | * |🏫 Кабинет: CW-1 |\n"
          "3️⃣: | Физика  | * |🕒 12:10-13:30 | * |🏫 Кабинет: 206 |",
    'friday': "📅 *Пятница* (1-я группа):\n"
          "1️⃣: | Алгебра | * |🕒 8:30-9:50 | * |🏫 Кабинет: 210 |\n"
          "2️⃣: | Кураторский час | * |🕒 10:10-10:50 | * |🏫 Кабинет: 210 |\n"
          "3️⃣: | Физика  | * |🕒 10:10-11-30 | * |🏫 Кабинет: 206 |\n"
          "4️⃣: | Русский язык  | * |🕒 12:10-13:30 | * |🏫 Кабинет: 210 |\n",
    'saturday': "📅 *Суббота* (1-я группа):\n"
          "1️⃣: | (Н/Н) Всемирная история | * |🕒 8:30-9:50 | * |🏫 Кабинет: 210 |\n"
          "1️⃣: | (Ч/Н) Правоведение | * |🕒 8:30-9:50 | * |🏫 Кабинет: 210 |\n"
          "2️⃣: | Физика  | * |🕒 10:10-11-30 | * |🏫 Кабинет: 206 |\n"
          "3️⃣: | Алгебра | * |🕒 12:10-13:30 * |🏫 Кабинет: 210|\n",
}


SCHEDULE_2 = {
    'monday': "📅 *Понедельник* (2-я группа):\n"
          "1️⃣: | Физкультура | * |🕒 8:30-9:50 | * |🏫 Кабинет: С/З |\n"
          "2️⃣: | Алгебра | * |🕒 10:10-11-30 | * |🏫 Кабинет: 209 |\n"
          "3️⃣: | (Н/Н) Литература | * |🕒 12:10-13:30 | * |🏫 Кабинет: 210 |\n"
          "3️⃣: | (Ч/Н) Воспитание | * |🕒 12:10-13:30 | * |🏫 Кабинет: 210|\n",
    'tuesday': "📅 *Вторник* (2-я группа):\n"
          "1️⃣: | Физика  | * |🕒 8:30-9:50 | * |🏫 Кабинет: 206 |\n"
          "2️⃣: | (Н/Н) Химия | * |🕒 10:10-11-30 * |🏫 Кабинет: 106|\n"
          "2️⃣: | (Ч/Н) Биология | * |🕒 10:10-11-30 | * |🏫 Кабинет: 106 |\n"
          "3️⃣: | Геометрия | * |🕒 12:10-13:30 | * |🏫 Кабинет: 210 |",
    'wednesday': "📅 *Среда* (2-я группа):\n"
          "1️⃣: | География | * |🕒 8:30-9:50 | * |🏫 Кабинет: 210 |\n"
          "2️⃣: | Геометрия | * |🕒 10:10-11-30 | * |🏫 Кабинет: 210 |\n"
          "3️⃣: | Физика   | * |🕒 12:10-13:30 | * |🏫 Кабинет: 206 |",
    'thursday': "📅 *Четверг* (2-я группа):\n"
          "1️⃣: | Физика  | * |🕒 8:30-9:50 | * |🏫 Кабинет: 206 |\n"
          "2️⃣: | Информатика | * |🕒 10:10-11-30 | * |🏫 Кабинет: CW-2 |\n"
          "3️⃣: | Алгебра  | * |🕒 12:10-13:30 | * |🏫 Кабинет: 210 |",
    'friday': "📅 *Пятница* (2-я группа):\n"
          "1️⃣: | Аглийский язык | * |🕒 8:30-9:50 | * |🏫 Кабинет: 209 |\n"
          "2️⃣: | Кураторский час | * |🕒 10:10-10:50 | * |🏫 Кабинет: 210 |\n"
          "3️⃣: | Алгебра  | * |🕒 10:10-11-30 | * |🏫 Кабинет: 210 |\n"
          "4️⃣: | Русский язык  | * |🕒 12:10-13:30 | * |🏫 Кабинет: 210 |\n",
    'saturday': "📅 *Суббота* (2-я группа):\n"
          "1️⃣: | (Н/Н) Всемирная история | * |🕒 8:30-9:50 | * |🏫 Кабинет: 210 |\n"
          "1️⃣: | (Ч/Н) Правоведение | * |🕒 8:30-9:50 | * |🏫 Кабинет: 210 |\n"
          "2️⃣: | Аглийский язык  | * |🕒 10:10-11-30 | * |🏫 Кабинет: 210 |\n"
          "3️⃣: | Узбекский язык | * |🕒 12:10-13:30 * |🏫 Кабинет: 202|\n",
}

SCHEDULE = {'1': SCHEDULE_1, '2': SCHEDULE_2}

first_schedule_templates = [
        "Не забудьте сделать домашнее задание на Понедельник: 1-подгруппа\n"
                                       "1) Физкультура: Д/з - \n"
                                       "2) Аглийский язык: Д/з - \n"
                                       "3) (Н/Н) Литература: Д/з - \n"
                                       "3) (Ч/Н) Воспитание: Д/з - \n",

        "Не забудьте сделать домашнее задание на Вторник: 1-подгруппа\n"
                                       "1) Узбекский язык: Д/з - \n"
                                       "2) (Н/Н) Химия: Д/з - \n"
                                       "2) (Ч/Н) Биология: Д/з - \n"
                                       "3) Геометрия: Д/з - \n",

        "Не забудьте сделать домашнее задание на Среду: 1-подгруппа\n"
                                       "1) География: Д/з - \n"
                                       "2) Аглийский язык : Д/з - \n"
                                       "3) Алгебра: Д/з - \n",

        "Не забудьте сделать домашнее задание на Четверг: 1-подгруппа\n"
                                       "1) Геометрия: Д/з - \n"
                                       "2) Информатика: Д/з - \n"
                                       "3) Физика : Д/з - \n",

        "Не забудьте сделать домашнее задание на Пятницу: 1-подгруппа\n"
                                       "1) Алгебра: Д/з - \n"
                                       "2) Кураторский час: Д/з - \n"
                                       "3) Физика: Д/з - \n"
                                       "4) Русский язык : Д/з - \n",

        "Не забудьте сделать домашнее задание на Субботу: 1-подгруппа\n"
                                       "1) (Н/Н) Всемирная история: Д/з - \n"
                                       "1) (Ч/Н) Правоведение: Д/з - \n"
                                       "2) Физика : Д/з - \n"
                                       "3) Алгебра : Д/з - \n"
]

second_schedule_templates = [
        "Не забудьте сделать домашнее задание на Понедельник: 2-подгруппа\n"
                                       "1) Физкультура: Д/з - \n"
                                       "2) Алгебра: Д/з - \n"
                                       "3) (Н/Н) Литература: Д/з - \n"
                                       "3) (Ч/Н) Воспитание: Д/з - \n",
        "Не забудьте сделать домашнее задание на Вторник: 2-подгруппа\n"
                                       "1) Физика : Д/з - \n"
                                       "2) (Н/Н) Химия: Д/з - \n"
                                       "2) (Ч/Н) Биология: Д/з - \n"
                                       "3) Геометрия: Д/з - \n",
        "Не забудьте сделать домашнее задание на Среду: 2-подгруппа\n"
                                       "1) География: Д/з - \n"
                                       "2) Геометрия : Д/з - \n"
                                       "3) Физика : Д/з - \n",
        "Не забудьте сделать домашнее задание на Четверг: 2-подгруппа\n"
                                        "1) Физика : Д/з - \n"
                                        "2) Информатика: Д/з - \n"
                                        "3) Алгебра : Д/з - \n",
        "Не забудьте сделать домашнее задание на Пятницу: 2-подгруппа\n"
                                       "1) Аглийский язык: Д/з - \n"
                                       "2) Кураторский час: Д/з - \n"
                                       "3) Алгебра: Д/з - \n"
                                       "4) Русский язык : Д/з - \n",
        "Не забудьте сделать домашнее задание на Субботу: 2-подгруппа\n"
                                       "1) (Н/Н) Всемирная история: Д/з - \n"
                                       "1) (Ч/Н) Правоведение: Д/з - \n"
                                       "2) Аглийский язык : Д/з - \n"
                                       "3) Узбекский язык : Д/з - \n"
]
